// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let num_1 = +prompt('Введіть перше число: ');
// let num_2 = +prompt('Введіть друге число: ');
// if (num_1 > num_2) {
//     console.log(`Максимальне число ${num_1}`);
// } else if (num_2 > num_1) {
//     console.log(`Максимальне число ${num_2}`);
// } else if (num_1 === num_2) {
//     console.log(`Введені числа є рівними ${num_1} та ${num_2}`);
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let num = +prompt('Введіть номер квартири');
// if ((num >=1) &&(num <=20)) {
//     console.log('Квартира знаходиться в першому під`їзді');
// } else if ((num >=21) &&(num <=48)) {
//     console.log('Квартира знаходиться в другому під`їзді');
// } else if ((num >=49) &&(num <=90)) {
//     console.log('Квартира знаходиться в третьому під`їзді');
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let num = +prompt('Введіть число');
// if (num === 10) {
//     console.log('ВІРНО');
// } else {
//     console.log('НЕВІРНО');
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
//     якщо в змінну записали щось інше, спрацьовує else

// let x = 1;
// console.log(typeof x);
// console.log(x);
// if (typeof x === "number") {
//     x = x.toString()
//     console.log(1);
// } else if (typeof x === "string") {
//     console.log(2);
// } else if (typeof x === "boolean") {
//     console.log(3);
// } else if (typeof x === "object") {
//     console.log(3);
// } else {
//     console.log('Спрацював else');
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let t = +prompt('Введіть значення температури на вулиці: ')
// if ((t >= 10) && (t <= 22)) {
//     console.log('Ми йдемо ВЧИТИСЯ');
// } else {
//     console.log('Сидимо вдома і вчимося ОНЛАЙН');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let num = prompt('Введіть число: ')
// switch (num) {
//     case '1': {
//             console.log('Ви виграли Авто');
//         break;
//     }
//     case '2': {
//         console.log('Ви виграли Мото');
//         break;
//     }
//     case '3': {
//         console.log('Ви виграли Телефон');
//         break;
//     }
//     case '4': {
//         console.log('Ви виграли Квартиру');
//         break;
//     }
//     case '5': {
//         console.log('Ви виграли Подорож на двох на Мальдіви');
//         break;
//     }
//     default:{
//         console.log('Число не вірне!!!');
//     }
// }